Revit 2027 API
ConceptualSurfaceType.GetConstructionTypeIds Method
 The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetConstructionTypeIds()
Public Function GetConstructionTypeIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetConstructionTypeIds()
member GetConstructionTypeIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace